DanielEduardoBarba/ESP32S3_Touch7_Display/firmware/common/sdkconfig.defaults
# Shared sdkconfig defaults for the Waveshare ESP32-S3-Touch-LCD-7
# (ESP32-S3-N16R8: 16MB quad-SPI flash, 8MB octal-SPI PSRAM).
#
# Both ESP-IDF projects in this repo (firmware/factory and firmware/app)
# include this file via their own sdkconfig.defaults using:
#   set(SDKCONFIG_DEFAULTS "../common/sdkconfig.defaults;sdkconfig.defaults")
# (see each project's CMakeLists.txt)
#
# Values here mostly mirror Waveshare's own recommended menuconfig settings
# for this board (see https://www.waveshare.com/wiki/ESP32-S3-Touch-LCD-7),
# using the safer 80MHz flash/PSRAM speed instead of the experimental 120MHz
# option for maximum compatibility. See README.md for how to opt into 120MHz.

CONFIG_IDF_TARGET="esp32s3"

# --- Flash / PSRAM ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
# Keep scarce INTERNAL RAM for what can only live there (task stacks, DMA,
# WiFi internals): allocations above 512B go to PSRAM first instead of the
# default 16KB threshold, and WiFi/LWIP buffers may use PSRAM too. Without
# this, five LVGL scenes of widgets drained internal heap to <10KB and task
# creation (web server, fw-update sender) started failing.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=512
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# Keep the UART ISR running while flash operations disable the cache
# (OTA writes during device-to-device updates!). Without this, non-IRAM
# ISRs are suspended during every flash write and the 128-byte RX FIFO
# overflows in <3ms at 460800 baud, corrupting mid-transfer frames.
CONFIG_UART_ISR_IN_IRAM=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# --- Performance / RTOS ---
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y

# --- Custom partition table shared by both firmware stages ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../partitions.csv"

# --- OTA rollback (high-reliability boot flow) ---
# With this enabled, an image installed via esp_ota_set_boot_partition()
# boots in "pending verify" state. It must prove itself healthy by calling
# esp_ota_mark_app_valid_cancel_rollback() (see firmware/app/main/boot_health.cpp)
# -- if it crashes or resets before doing so, the STOCK 2nd-stage bootloader
# automatically rolls back to the previous working image (or falls back to
# the factory/recovery app if no valid OTA slot remains). All of this is
# built into ESP-IDF; no custom boot-manager layer is involved.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# --- USB / console ---
# This board has TWO USB-C ports: one wired to the ESP32-S3's *native*
# USB-Serial/JTAG peripheral, and one ("UART1" on the silkscreen) wired
# through a separate CH343 USB-UART bridge chip to the classic UART0 pins.
# Confirmed empirically that the native USB-JTAG port's auto-reset (used by
# both esptool and idf.py monitor) is unreliable on this board -- it
# frequently leaves the chip stuck in bootloader/download mode instead of
# running the app, matching Waveshare's own docs which say to manually press
# RESET after flashing when using that port.
#
# The "UART1" port doesn't have that problem (plain classic RTS/DTR
# auto-reset works every time), so route the console there instead: classic
# UART0, which is what the 2nd-stage bootloader already logs to by default
# regardless of this setting. Use `build.sh`/`tools/dev_monitor.py` with the
# board connected to "UART1", not the plain "USB" port.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE_115200=y

# --- ESP32_Display_Panel: board selection ---
# The actual board-variant selection (Waveshare "7" vs "7B") lives in
# sdkconfig.defaults.7 / sdkconfig.defaults.7b (see ../README.md and
# build.sh's `--variant` flag) -- CMakeLists.txt layers one of those on top
# of this shared file based on $ENV{TOUCH_ESP32_VARIANT}.

# --- LVGL (v8.4, configured via Kconfig instead of a hand-written lv_conf.h) ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_16_SWAP=n
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_ATTRIBUTE_FAST_MEM_IRAM=y
# LVGL's built-in perf monitor is replaced by the project's own combined
# FPS/CPU/RAM/PSRAM card (firmware/common/dev_monitor.h, dev builds only).
# CONFIG_LV_USE_PERF_MONITOR is not set
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_16=y
CONFIG_LV_USE_DROPDOWN=y
CONFIG_LV_USE_MSGBOX=y
CONFIG_LV_USE_KEYBOARD=y
CONFIG_LV_USE_TEXTAREA=y
CONFIG_LV_USE_LIST=y
CONFIG_LV_USE_MENU=y
